ГТС/УТГТС/DataProcessors/ПодборТоваровВДокументПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПодборТоваровВДокументПродажи</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Корзина</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПоставки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураНабора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНабора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОбеспечения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обособленно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркетинговоеМероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Catalogs/ВариантыКомплектацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВариантыКомплектацииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьСборкиРазборки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаЦеныНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаЦенНаборов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПредставленияНабораВПечатныхФормах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПредставленияНаборовВПечатныхФормах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитТовары</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/DataProcessors/ПодборТоваровВДокументПродажи/Forms/ЦеныНоменклатуры/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	//++//ASP_Crow 18.03.2026 000029567 В расширение
	//ASP_Dante 12/07/21 Задача 000011492 перенос доработок
	АрхивнаяПозиция=Параметры.Номенклатура.ASP_АрхивнаяПозиция;
	Если АрхивнаяПозиция=Истина Тогда
		Элементы.АрхивнаяПозицияКартинка.Видимость=Истина;
	КонецЕсли;
	//ASP_Dante 12/07/21
	Заголовок = Заголовок + ": "+ Параметры.Номенклатура;
	//ASP_Dante 12/07/21 Задача 000011492 перенос доработок
	Артикул = Параметры.Номенклатура.Артикул;
	Номенклатура=Параметры.Номенклатура;
	//ASP_Dante 12/07/21
	//--//ASP_Crow 18.03.2026 000029567 В расширение
	Если ЗначениеЗаполнено(Параметры.Характеристика) Тогда
		Элементы.СписокХарактеристика.Видимость = Ложь;
		Заголовок = Заголовок + " ("+ Параметры.Характеристика + ")";
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Дата", Параметры.Дата); 
	
	//++//ASP_Crow 18.03.2026 000029567 В расширение
	//ГТС 13042021 добавляем закупочные цены
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ASP_ЗакупочныеЦены") Тогда 
		ВидЦен = Новый СписокЗначений;
		ВидЦен.Добавить(Справочники.ВидыЦен.Закупочная); 
		попытка
			ВидЦен.Добавить(Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("86430129-ae9a-4b4e-be0b-b7716059293c")));
		Исключение конецпопытки;
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ВидЦены", ВидЦен)
	Иначе ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ВидЦены", Справочники.ВидыЦен.ПустаяСсылка()) ;
	КонецЕсли; 
	//--//ASP_Crow 18.03.2026 000029567 В расширение
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Номенклатура",
		Параметры.Номенклатура,
		ВидСравненияКомпоновкиДанных.Равно,,Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Характеристика",
		Параметры.Характеристика,
		ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Параметры.Характеристика)); 
		
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЦеныНоменклатуры.ВидЦены КАК ВидЦены,
	               |	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатуры.Характеристика КАК Характеристика,
	               |	МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	               |ПОМЕСТИТЬ ВТДатыЦен
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	               |ГДЕ
	               |	(ЦеныНоменклатуры.ВидЦены В (&ВидЦены)
	               |			ИЛИ ЦеныНоменклатуры.ВидЦены.ИспользоватьПриПродаже = ИСТИНА)
	               |	И ЦеныНоменклатуры.Период <= &Дата
	               |	И ЦеныНоменклатуры.Номенклатура = &Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЦеныНоменклатуры.ВидЦены,
	               |	ЦеныНоменклатуры.Номенклатура,
	               |	ЦеныНоменклатуры.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТДатыЦен.ВидЦены КАК ВидЦены,
	               |	ВТДатыЦен.Номенклатура КАК Номенклатура,
	               |	ВТДатыЦен.Характеристика КАК Характеристика,
	               |	ВТДатыЦен.Период КАК Период,
	               |	ЦеныНоменклатуры.Цена КАК Цена,
	               |	ЦеныНоменклатуры.Упаковка КАК Упаковка,
	               |	ЦеныНоменклатуры.Валюта КАК Валюта
	               |ИЗ
	               |	ВТДатыЦен КАК ВТДатыЦен
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	               |		ПО (ЦеныНоменклатуры.Период = ВТДатыЦен.Период)
	               |			И (ЦеныНоменклатуры.Номенклатура = ВТДатыЦен.Номенклатура)
	               |			И (ЦеныНоменклатуры.Характеристика = ВТДатыЦен.Характеристика)
	               |			И (ЦеныНоменклатуры.ВидЦены = ВТДатыЦен.ВидЦены)
	               |ГДЕ
	               |	ЦеныНоменклатуры.Цена > 0";
	
	//ГТС 13042021 добавляем закупочные цены
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ASP_ЗакупочныеЦены") Тогда 
		ВидЦен = Новый СписокЗначений;
		ВидЦен.Добавить(Справочники.ВидыЦен.Закупочная); 
		попытка
			ВидЦен.Добавить(Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("86430129-ae9a-4b4e-be0b-b7716059293c")));
		Исключение конецпопытки;
		Запрос.УстановитьПараметр("ВидЦены", ВидЦен);
	Иначе 
		Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.ПустаяСсылка());
	КонецЕсли; 
	//
	
	Запрос.УстановитьПараметр("Номенклатура", Параметры.Номенклатура); 
	Запрос.УстановитьПараметр("Дата", Параметры.Дата);
	рез = Запрос.Выполнить().ВЫгрузить();
	Для каждого СтрРез из Рез Цикл
		НовСтр = СписокНетип.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр , СтрРез);
		НовСтр.ЕдИзм = НовСтр.Номенклатура.ЕдиницаИзмерения;
	КонецЦикла;
		
		
	//++//ASP_Crow 18.03.2026 000029567 В расширение
	//+ГТС суммируем цены комплектов 02062019
	если Параметры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВариантыКомплектацииНоменклатурыТовары.Номенклатура) КАК Номенклатура,
		|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК Количество,
		|	СУММА(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)) КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ВариантыКомплектацииНоменклатуры.Владелец КАК Владелец,
		|	СУММА(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ВариантыКомплектацииНоменклатурыТовары.Количество) КАК ЦенаИтог,
		|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Период) КАК Дата
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), {(Номенклатура).* КАК Номенклатура, (Характеристика).* КАК Характеристика}) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ВариантыКомплектацииНоменклатурыТовары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец = &Владелец
		|	И ВариантыКомплектацииНоменклатурыТовары.Ссылка.Основной = ИСТИНА
		|	И (ЦеныНоменклатурыСрезПоследних.ВидЦены.ИспользоватьПриПродаже = ИСТИНА
		|			ИЛИ ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены)
		|	И ЦеныНоменклатурыСрезПоследних.ВидЦены.ПометкаУдаления <> ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены,
		|	ВариантыКомплектацииНоменклатуры.Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидЦены
		|АВТОУПОРЯДОЧИВАНИЕ";
	  	Запрос.УстановитьПараметр("Владелец", Параметры.Номенклатура);
		Запрос.УстановитьПараметр("Дата", Параметры.Дата);
		//ГТС 13042021 добавляем закупочные цены
		Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ASP_ЗакупочныеЦены") Тогда 
			ВидЦены=Справочники.ВидыЦен.Закупочная;
		Иначе 
			ВидЦены=Справочники.ВидыЦен.ПустаяСсылка();
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
		
	
		РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
	    ЭтаФорма.Элементы.ГруппаЦенаНабора.Видимость = ИСТИНА;
		ЭтаФорма.Элементы.Список.Видимость = Ложь;
	КонецЕсли;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ЦенаИтог>0 Тогда
		новаяСтрока = ЦенаНабора.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока , ВыборкаДетальныеЗаписи);		
		Иначе
		КонецЕсли;
	КонецЦикла;
	
	КонецЕсли;
	// +ГТС суммируем цены комплектов 02062019 
	//--//ASP_Crow 18.03.2026 000029567 В расширение
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Остатки(Команда)
	// Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Дата", ТекущаяДата());
	ПараметрыФормы.Вставить("Номенклатура", Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма.ОстаткиТоваровНаСкладах", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НаСайте(Команда)
	ЗапуститьПриложение("https://gortorgsnab.ru/search/?q="+Артикул);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточку(Команда)
	ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Дата", ТекущаяДата());
	ПараметрыФормы.Вставить("Ключ", Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма)

КонецПроцедуры

#КонецОбласти
